Revit 2027 API
FillPattern(FillPattern) Constructor
 Constructs a new copy of the input FillPattern object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FillPattern(
	FillPattern other
)
Public Sub New (
	other As FillPattern
)
public:
FillPattern(
	FillPattern^ other
)
new :
        other : FillPattern -> FillPattern
Parameters
other FillPattern
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FillPattern Class
FillPattern Overload
Autodesk.Revit.DB Namespace